import Foundation
var x = 0
var y = 0
var a: Double = 0
var b: Double = 0
// 3.1 変数xに3を代入し、変数yに4を代入し、xとyの和を出力してください。
x = 3
y = 4
print(x+y)
// 3.2 変数xに10を代入し、変数yに3を代入し、xからyを引いた結果を出力してください。
x = 10
y = 3
print(x - y)
// 3.3 変数xに5を代入し、変数yに8を代入し、xとyの積を出力してください。
x = 5
y = 8
print(x*8)
// 3.4 変数xに20を代入し、変数yに4を代入し、xをyで割った結果を出力してください。
x = 20
y = 4
print(x / y)
// 3.5 変数xに7を代入し、変数yに3を代入し、xをyで割った余りを出力してください。
x = 7
y = 3
print(x % y)
// 3.6 変数aに2を代入し、aの3乗を出力してください。
a = 2
print(pow(a, 3))
// 3.7 変数aに8を代入し、aの平方根を出力してください。
a = 8
print(sqrt(a))
// 3.8 変数aに2を代入し、変数bに3を代入し、aのb乗を出力してください。
a = 2
b = 3
print(pow(a, b))
// 3.9 変数xに100を代入し、変数yに5を代入し、xとyの和、差、積、商を出力してください。
x = 100
y = 5
print(x+y)
print(x-y)
print(x*y)
print(x/y)
// 3.10 変数aに3.14を代入し、aを四捨五入して整数にして出力してください。
a = 3.14
print(round(a))
